# Updating DataFrames

## Data: Palmer Penguins

In [1]:
#import libraries
import pandas as pd
import numpy as np

import seaborn as sns
import random

In [2]:
#load in the data
penguins = sns.load_dataset('penguins')

In [3]:
#view the data
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

# Manipulating a dataframe

add a new column
```
df['newcolname'] = new_column values
```

New Column Values could be:
 - a `pd.Series` or `numpy.arrray`
 - a single scalar value

In [4]:
penguins['body_mass_kg'] = penguins.body_mass_g/1000

# confirm the new column is in the data frame
print('body_mass_kg' in penguins.columns)

# take a look at the new column
penguins.head()

True

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,body_mass_kg
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,3.75
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,3.80
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,3.25
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,3.45

To creat a new column and change where the new column is added, `use insert()`
```
df.insert(loc = integers_index,
column = 'new_column_name',
value = new_col_values) # location of new column
```

Suppose each penguin gets a unique three digit code as an identifier. Add this column to the dataframe:

In [6]:
#create random 3 digit codes
codes = random.sample(range(100,1000), len(penguins))

penguins.insert(loc = 0,
               column = 'code',
               value = codes)

In [7]:
penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,body_mass_kg
0,425,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,3.75
1,949,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,3.80
2,997,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,3.25
3,499,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,328,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,3.45

## Adding multiple columns

In [8]:

#df.assign( new_col1_name = new_col1_values, 
#           new_col2_name = new_col2_values)

# create new columns in the data frame
# random.choices used for random sampling with replacement
# need to reassign output of assign() to update the data frame
penguins = penguins.assign( flipper_length_cm = penguins.flipper_length_mm /10, 
                            observer =   random.choices(['A','B','C'], k=len(penguins)))
# look at result
penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,body_mass_kg,flipper_length_cm,observer
0,425,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,3.75,18.1,A
1,949,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,3.80,18.6,C
2,997,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,3.25,19.5,B
3,499,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A
4,328,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,3.45,19.3,B

## Drop a Column
We can remove columns using the drop() method for data frames, the syntax is:

df = df.drop(columns = col_names)

where col_names can be a single column name (str) or a list of column names. The drop() method does not modify the data frame in place, so you need to reassign the output.

In [9]:
# use a list of column names
# reassign output of drop() to dataframe to update it
penguins = penguins.drop(columns=['flipper_length_mm','body_mass_g'])

# check columns
print(penguins.columns)

Index(['code', 'species', 'island', 'bill_length_mm', 'bill_depth_mm', 'sex',
       'body_mass_kg', 'flipper_length_cm', 'observer'],
      dtype='object')

# Updating Values
Sometimes we want to update certain values in our data frame using the location

- at[]: Select by labels
- iat[]: Select by index

Syntax for at[]
```
df.at[single_index_value, 'column_name']
```
Syntax for iat[]

```
df.iat[24,3]

In [11]:
# access value at row with index=3 and column='bill_length_mm'
penguins.at[3,'bill_length_mm']

# update NA to 38.3
penguins.at[3,'bill_length_mm'] = 38.3

# check it was updated
penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,sex,body_mass_kg,flipper_length_cm,observer
0,425,Adelie,Torgersen,39.1,18.7,Male,3.75,18.1,A
1,949,Adelie,Torgersen,39.5,17.4,Female,3.80,18.6,C
2,997,Adelie,Torgersen,40.3,18.0,Female,3.25,19.5,B
3,499,Adelie,Torgersen,38.3,NaN,NaN,NaN,NaN,A
4,328,Adelie,Torgersen,36.7,19.3,Female,3.45,19.3,B

# Multiple values in a column
## By condition
Often we want to create a new column where the new values depend on conditions on another column’s values.

Example

Suppose we want to classify all penguins with body mass less than 3kg as small, penguins with body mass greater or equal than 3kg but less than 5kg as medium, and those with body mass greater or equal than 5kg as large. One way to add this information in a new column using `numpy.select()`:

In [14]:
# create a list with the conditions
conditions = [penguins.body_mass_kg < 3, 
              (3 <= penguins.body_mass_kg) & (penguins.body_mass_kg < 5),
              5 <= penguins.body_mass_kg]

# create a list with the choices
choices = ["small",
           "medium",
           "large"]

# add the selections using np.select
# default = value for anything that falls outside conditions
penguins['size'] = np.select(conditions, choices, default=np.nan)

penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,sex,body_mass_kg,flipper_length_cm,observer,size
0,425,Adelie,Torgersen,39.1,18.7,Male,3.75,18.1,A,medium
1,949,Adelie,Torgersen,39.5,17.4,Female,3.80,18.6,C,medium
2,997,Adelie,Torgersen,40.3,18.0,Female,3.25,19.5,B,medium
3,499,Adelie,Torgersen,38.3,NaN,NaN,NaN,NaN,A,nan
4,328,Adelie,Torgersen,36.7,19.3,Female,3.45,19.3,B,medium

When we only want to update some values in a column we can do this by selecting this data using loc (if selecting by labels) or iloc (if selecting by position). The general sytanx for updating data with loc is:

### modifies data in place
`df.loc[row_selection, col_name] = new_values`

where

- `row_selection` is the rows we want to update
- `col_name` is a single column name
- `new_values` is the new value or values we want. If using multiple values, then new_values must be of the same length as the number of rows selected

Example

Suppose we want to update the “Male” value in the sex column to “M”.

In [16]:
# select rows with sex=male and update the values in the sex column
penguins.loc[penguins.sex=='Male', 'sex'] = 'M'
penguins.loc[penguins.sex=='Female', 'sex'] = 'F'

# check changes
penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,sex,body_mass_kg,flipper_length_cm,observer,size
0,425,Adelie,Torgersen,39.1,18.7,M,3.75,18.1,A,medium
1,949,Adelie,Torgersen,39.5,17.4,F,3.80,18.6,C,medium
2,997,Adelie,Torgersen,40.3,18.0,F,3.25,19.5,B,medium
3,499,Adelie,Torgersen,38.3,NaN,NaN,NaN,NaN,A,nan
4,328,Adelie,Torgersen,36.7,19.3,F,3.45,19.3,B,medium

## `SettingWithCopyWarning`
NOTE: This is a warning that is trying to tell you that it doesn't know what you want to do, and its pretty sure YOU don't know what youre doing

Suppose we want to update the Female column to F:
this is an example of something we might try but wont work
`
penguins[penguins.sex=='Female']['sex']= 'F'
`

To see what is going on we need to understand that some pandas operations return a view to your data, while others return a copy of your data.

- Views are actual subsets of the original data, when we update them, we are modifying the original data frame.

- Copies are unique objects, independent of our original data frames. When we update a copy we are not modifying the original data frame.

Depending on what we are trying to do we might want to modify the original data frame or we might want to modify a copy.

Another common situation where SettingWithCopyWarning comes up is when we try to update a subset of a data frame we have already stored in a new variable.

Example

Suppose we only want to use data from Biscoe island and, after doing some analyses, we want to add a new column to it:

In [20]:
# select penguins from Biscoe island
biscoe = penguins[penguins.island=='Biscoe']

# 50 lines of code here

# add a column, we get a warning
biscoe['sample_col'] = 100

/tmp/ipykernel_5316/1247240670.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  biscoe['sample_col'] = 100

It might not seem like it, but we have a chained assignment here too. We essentialy wrote:
`
penguins[penguins.island=='Biscoe']['sample_col'] = 100
`

To fix this we can take control of the copy-view situation and explicitely ask for a copy of the dataset when subsetting the data. Use the copy() method to do this:

In [21]:
# make sure you get a new data frame with penguins from Biscoe island
biscoe = penguins[penguins.island=='Biscoe'].copy()

# add a column, no warning
biscoe['sample_col'] = 100